#+title:    Email Emacs Configuration
#+author:   Logan Barnett
#+email:    logustus@gmail.com
#+date:     <2018-01-31 Wed 06:48>
#+language: en
#+tags:     email config

**** capture email link
#+name: config/email-mu4e-capture-template-add
#+begin_src emacs-lisp :tangle no :noweb yes
<<config/email-mu4e-remove-capture-template>>
(config/email-mu4e-remove-capture-template "e")
(add-to-list
 'org-capture-templates
 '("e"
    "email"
    entry
    (file "~/notes/inbox.org")
    ;; (file+headline "~/notes/inbox.org" "Tasks")
    "* TODO [#A] %?
SCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))
%a
"
    )
 )
#+end_src

#+RESULTS: config/email-mu4e-capture-template-add
| e | email | entry | (file ~/notes/inbox.org) | * TODO [#A] %? |

This could be used for any arbitrary file capture, but I'd like to keep one
specifically reserved for emails. They could vary, and while emails can be
represented as files, I feel they are more specialized - there is strong
incentive to map more of the email out with a more sophisticated capture
template.

